---
kind: property
id: P:Autodesk.Revit.DB.ImageExportOptions.ViewName
source: html/d264fa66-1a71-be0e-e203-ba497bccc61d.htm
---
# Autodesk.Revit.DB.ImageExportOptions.ViewName Property

The name of the view to be created.

## Syntax (C#)
```csharp
public string ViewName { get; set; }
```

## Remarks
This field is used only to save an image to a project as a new view.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null